<?php

declare(strict_types = 1);

namespace AvtoDev\ExtendedLaravelValidator\Tests\Extensions;

use AvtoDev\ExtendedLaravelValidator\Extensions\PtsCodeValidatorExtension;

/**
 * @covers \AvtoDev\ExtendedLaravelValidator\Extensions\PtsCodeValidatorExtension
 * @covers \AvtoDev\ExtendedLaravelValidator\AbstractValidatorExtension::message
 * @covers \AvtoDev\ExtendedLaravelValidator\ServiceProvider::boot
 */
class PtsCodeValidatorExtensionTest extends AbstractExtensionTestCase
{
    /**
     * {@inheritdoc}
     */
    protected function getExtensionClassName(): string
    {
        return PtsCodeValidatorExtension::class;
    }

    /**
     * {@inheritdoc}
     */
    protected function getInvalidValues(): array
    {
        return [
            // Слишком длинные
            '13НО2323524663',
            '72УС424334434',
            '39НЕ2484231531',
            '40НК602618533',
            '02УК92239032',
            '47ТА1838433',
            '12АБ3456789',

            // Слишком короткие
            '78УС41537',
            '77УН8055',
            '78УЕ951',
            '39НО52',
            '77С98308',
            '46УО34',
            '77У',
            '12АБ34567',

            // С пробелами не по феншую
            '  25УР529766',
            '60ВТ667733  ',
            ' 78ОМ921332 ',
            ' 77УА935302  ',
            '  12АБ345678  ',
            '12 А345678',

            // Содержащие запрещенные символы
            '78_УС944099',
            '39НЕ857@176',
            '77УА96*135',
            '78УА05А2443',
            '63НМ915F281',
            '78ТУ6216%55',
            '39SНН651930',
            '78УВ43&8226',
            '18МТ47472G9',
            '77УА9(74000',
            '12аб345678', // строчные буквы
            '12AB345678', // латинские буквы
            '12.А345678', // точка
            '12-А345678', // дефис

            // Состоящие только из букв
            'ОНОНОНОНОН',
            'ТМТМТМТМТМ',

            // Не соответствующие формату
            'А2АБ345678', // первый символ не цифра
            '1ААБ345678', // второй символ не цифра
            '12А3345678', // третий символ буква, четвертый цифра — комбинация не допускается
            '123А345678', // третий символ цифра, четвертый буква — комбинация не допускается
            '1299345678', // все цифры
            '12АБ34567А', // последний символ буква
            '12АБ34А678', // есть буква внутри последних шести
        ];
    }

    /**
     * {@inheritdoc}
     */
    protected function getValidValues(): array
    {
        return [
            // С пробелами (серия с буквами)
            '78 УЕ 952328',
            '16 НО224663',
            '78 УС434434',
            '39 НЕ 248423',
            '40НК 602618',
            '02УК 922390',
            '47 ТА 183843',

            '78УЕ952328',
            '16НО224663',
            '78УС434434',
            '39НЕ248423',
            '40НК602618',
            '02УК922390',
            '47ТА183843',
            '77УР781043',
            '61МЕ524040',
            '36ТС369230',
            '66ЕА402408',
            '78ОН937380',
            '78НР408206',
            '78УХ169669',
            '47НН307196',
            '78УН113064',
            '78УА115947',
            '47НМ321533',
            '78ТО073191',
            '78УМ119929',
            '39ТМ563386',
            '42УК452588',
            '39НЕ245073',
            '39ТМ563386',
            '61МС370573',
            '77ТР323897',
            '25УР529766',
            '60ВТ667733',
            '78ОМ921332',
            '77УА935302',
            '40НВ079158',
            '78ОЕ428114',
            '78УС415371',
            '77УН805532',
            '78УЕ951322',
            '39НО522304',
            '78УС983408',
            '39ОА455936',
            '46УО999434',
            '77УО057998',
            '77УН704900',
            '39НТ284120',
            '40НХ126615',
            '78УТ188336',
            '78УЕ249779',
            '78ОН927226',
            '77ТС260463',
            '77УН519063',
            '77УО128717',
            '39ТН112225',
            '78ТК031884',
            '25НН487669',
            '77ТС613495',
            '77НХ391287',
            '40НМ256423',
            '18МЕ459606',
            '40НА229767',
            '78УС500868',
            '50НА773969',
            '77ТТ748854',
            '78УА076742',
            '78НУ318739',
            '77УО819118',
            '77УС000146',
            '25ОН029167',
            '39ТН936734',
            '63МУ577558',
            '78УК010710',
            '77ТХ415094',
            '78УС982181',
            '78УН434096',
            '40НУ174909',
            '77УС077461',
            '78УО344551',
            '77УО598178',
            '77УН572708',
            '77УМ201875',
            '40ОМ069528',
            '66УО994708',
            '77УН738909',
            '78УС944099',
            '39НЕ857176',
            '77УА965135',
            '78УА052443',
            '63НМ915281',
            '78ТУ621655',
            '39НН651930',
            '78УВ438226',
            '18МТ474729',
            '77УА974000',
            '77УВ600767',
            '78УЕ974480',
            '78НР460564',
            '77ТУ419256',
            '77УА919798',
            '77УК151556',
            '47НЕ450869',
            '78УН371922',
            '78ОМ243043',
            '78УУ300901',
            '12АБ345678',
            '12АБ000001',
        ];
    }
}
